export type Est = Record<string, Record<number, number[]>>;
export type EstTable = Record<number, string[]>;
export type EstRes = [number | string, string, string];

// BODY_LENGTH_EST
export const BL_EST = {
  ж: {
    7: [114.5, 118.5, 126.0, 130.0],
    8: [115.5, 120.5, 129.5, 134.5],
    9: [120.0, 125.0, 134.5, 139.5],
    10: [125.0, 130.0, 140.0, 145.0],
    11: [131.0, 136.5, 148.0, 153.5],
    12: [134.5, 141.0, 153.5, 160.0],
  },
  м: {
    7: [114.0, 118.5, 127.0, 131.0],
    8: [117.0, 121.5, 130.0, 134.5],
    9: [120.5, 125.5, 136.5, 142.0],
    10: [125.5, 131.0, 141.0, 146.0],
    11: [132.5, 137.0, 146.0, 150.5],
    12: [133.5, 140.0, 152.5, 159.0],
  },
};

// BODY_WEIGHT_EST
export const BW_EST = {
  ж: {
    7: [18.2, 21.0, 26.5, 29.3],
    8: [18.5, 21.8, 28.2, 31.4],
    9: [20.4, 24.1, 31.4, 35.1],
    10: [23.1, 27.2, 35.2, 39.3],
    11: [25.5, 30.6, 40.7, 45.8],
    12: [28.8, 34.3, 45.0, 50.4],
  },
  м: {
    7: [18.8, 21.5, 26.6, 29.2],
    8: [19.1, 22.2, 28.3, 31.4],
    9: [20.6, 24.6, 32.4, 36.4],
    10: [23.2, 27.9, 37.2, 41.9],
    11: [25.6, 31.1, 41.9, 47.5],
    12: [27.3, 33.8, 46.8, 53.3],
  },
};

// BODY_WEIGHT_INDEX_EST
export const BWI_EST = {
  м: {
    7: [13.0, 14.4, 17.2, 18.6],
    8: [12.8, 14.4, 17.3, 18.8],
    9: [12.4, 14.5, 18.5, 20.5],
    10: [13.8, 15.6, 19.2, 21.0],
    11: [14.0, 16.0, 19.9, 21.9],
  },
  ж: {
    7: [13.0, 14.4, 17.1, 18.5],
    8: [12.7, 14.3, 17.4, 18.9],
    9: [12.8, 14.6, 17.9, 19.6],
    10: [13.8, 15.3, 18.4, 20.1],
    11: [13.7, 15.6, 19.3, 21.2],
  },
};

// CHEST_SIZE_EST
export const CS_EST = {
  м: {
    7: [45.5, 51.5, 63.0, 69.0],
    8: [50.5, 55.5, 65.5, 71.0],
    9: [53.5, 58.5, 68.0, 73.0],
    10: [55.0, 60.5, 71.0, 76.5],
    11: [58.5, 63.5, 73.0, 78.0],
  },
  ж: {
    7: [46.0, 52.0, 63.0, 69.0],
    8: [49.0, 54.5, 65.0, 70.5],
    9: [54.0, 58.5, 67.0, 71.5],
    10: [54.0, 59.5, 69.5, 74.5],
    11: [55.5, 61.5, 72.5, 78.0],
    12: [56.5, 63.5, 77.0, 84.0],
  },
};

// LUNGS_VITAL_CAPACITY_EST
export const LVC_EST = {
  м: {
    6: [600, 900],
    7: [1100, 1500],
    8: [1300, 1700],
    9: [1500, 2000],
    10: [1600, 2100],
    11: [1700, 2200],
  },
  ж: {
    6: [600, 900],
    7: [1000, 1300],
    8: [1200, 1600],
    9: [1300, 1800],
    10: [1400, 1900],
    11: [1500, 2000],
  },
};

// LEFT_PALM_STRENGTH_EST
export const LPS_EST = {
  м: {
    7: [1, 4, 8, 11],
    8: [2, 5, 10, 13],
    9: [4, 7, 12, 15],
    10: [5, 8, 14, 17],
    11: [7, 10, 16, 19],
  },
  ж: {
    7: [0, 3, 7, 10],
    8: [1, 2, 5, 12],
    9: [2, 3, 6, 13],
    10: [4, 5, 8, 14],
    11: [5, 6, 9, 16],
  },
};

// RIGHT_PALM_STRENGTH_EST
export const RPS_EST = {
  м: {
    7: [1, 4, 9, 12],
    8: [3, 6, 11, 14],
    9: [5, 8, 13, 16],
    10: [7, 10, 15, 18],
    11: [7, 11, 17, 21],
  },
  ж: {
    7: [1, 3, 8, 11],
    8: [2, 5, 10, 13],
    9: [3, 6, 11, 14],
    10: [5, 8, 13, 16],
    11: [6, 9, 14, 17],
  },
};

// LIFE_INDEX_EST
export const LI_EST = {
  м: {
    7: [34, 48, 62, 76],
    8: [33, 48, 64, 79],
    9: [31, 46, 63, 78],
    10: [32, 47, 64, 80],
    11: [31, 46, 63, 78],
  },
  ж: {
    7: [32, 46, 62, 77],
    8: [29, 45, 62, 77],
    9: [28, 44, 60, 75],
    10: [27, 42, 59, 75],
    11: [27, 42, 59, 74],
  },
};

// HEARD_RATE_EST
export const HR_EST = {
  м: {
    7: [79, 100],
    8: [80, 99],
    9: [76, 97],
    10: [74, 95],
    11: [72, 93],
  },
  ж: {
    7: [82, 99],
    8: [78, 100],
    9: [77, 99],
    10: [77, 99],
    11: [74, 95],
  },
};

// SYSTOLIC_PRESSURE_EST
export const SP_EST = {
  м: {
    7: [80, 99],
    8: [83, 101],
    9: [84, 105],
    10: [86, 107],
    11: [89, 108],
  },
  ж: {
    7: [79, 96],
    8: [82, 98],
    9: [83, 104],
    10: [83, 104],
    11: [87, 108],
  },
};

// DIASTOLIC_PRESSURE_EST
export const DP_EST = {
  м: {
    7: [47, 62],
    8: [49, 64],
    9: [50, 67],
    10: [53, 68],
    11: [53, 70],
  },
  ж: {
    7: [47, 62],
    8: [49, 62],
    9: [49, 66],
    10: [52, 67],
    11: [53, 68],
  },
};

export const PWC170_EST = {
  м: {
    7: [13.4, 20.5],
    8: [14.4, 21.5],
    9: [15.2, 22.7],
    10: [15.2, 22.7],
    11: [14.4, 21.5],
  },
  ж: {
    7: [12.0, 19],
    8: [12.0, 19],
    9: [13.0, 20],
    10: [14.4, 20.5],
    11: [14.0, 21],
  },
};

// FORWARD_BEND_EST
export const FB_EST = {
  м: {
    7: [0, 1, 6, 8],
    8: [0, 2, 7, 9],
    9: [0, 2, 8, 10],
    10: [0, 2, 8, 10],
    11: [0, 2, 9, 11],
    12: [0, 2, 9, 12],
  },
  ж: {
    7: [0, 2, 8, 10],
    8: [0, 3, 9, 12],
    9: [1, 4, 10, 13],
    10: [1, 4, 11, 14],
    11: [1, 5, 12, 15],
    12: [1, 5, 13, 16],
  },
};

// CARET_RUN_3_10_EST
export const CR_3_10_EST = {
  м: {
    7: [11.5, 10.9, 9.7, 9.2],
    8: [11.2, 10.6, 9.4, 8.8],
    9: [10.6, 10.1, 9.0, 8.4],
    10: [10.5, 9.9, 8.7, 8.1],
    11: [10.3, 9.7, 8.5, 7.9],
    12: [10.2, 9.6, 8.3, 7.7],
  },
  ж: {
    7: [11.9, 11.3, 10.1, 9.6],
    8: [11.6, 11.0, 9.7, 9.0],
    9: [11.1, 10.5, 9.3, 8.7],
    10: [10.8, 10.2, 9.0, 8.5],
    11: [10.7, 10.1, 8.8, 8.2],
    12: [10.2, 9.7, 8.6, 8.0],
  },
};

// PULL_UPS
export const PU_EST = {
  м: {
    7: [0, 0, 4, 6],
    8: [0, 0, 5, 7],
    9: [0, 0, 5, 7],
    10: [0, 0, 6, 8],
    11: [0, 1, 6, 8],
    12: [0, 1, 7, 10],
  },
  ж: {
    7: [0, 2, 9, 12],
    8: [0, 3, 11, 14],
    9: [0, 3, 12, 16],
    10: [0, 4, 14, 18],
    11: [1, 5, 15, 19],
    12: [1, 6, 15, 19],
  },
};

// RUN_30
export const R_30_EST = {
  м: {
    7: [8.2, 7.5, 6.1, 5.5],
    8: [8.2, 7.5, 6.0, 5.3],
    9: [7.7, 7.1, 5.7, 5.0],
    10: [7.4, 6.8, 5.5, 4.9],
    11: [7.3, 6.7, 5.3, 4.7],
    12: [7.8, 7.0, 5.1, 4.2],
  },
  ж: {
    7: [8.5, 7.8, 6.5, 5.8],
    8: [8.4, 7.7, 6.2, 5.5],
    9: [7.8, 7.2, 5.9, 5.3],
    10: [7.5, 7.0, 5.7, 5.1],
    11: [7.5, 6.9, 5.5, 4.8],
    12: [8.4, 7.4, 5.3, 4.3],
  },
};

// LENGTH_JUMP
export const LJ_EST = {
  м: {
    7: [95, 107, 133, 145],
    8: [102, 115, 140, 153],
    9: [113, 125, 151, 164],
    10: [119, 132, 159, 172],
    11: [130, 143, 169, 181],
    12: [138, 151, 178, 191],
  },
  ж: {
    7: [89, 101, 125, 137],
    8: [97, 109, 134, 146],
    9: [107, 119, 143, 155],
    10: [115, 127, 151, 163],
    11: [122, 134, 160, 173],
    12: [130, 142, 167, 180],
  },
};

// RUN_6M
export const R_6M_EST = {
  м: {
    7: [609, 715, 928, 1034],
    8: [655, 769, 999, 1114],
    9: [712, 829, 1064, 1180],
    10: [775, 892, 1127, 1244],
    11: [822, 946, 1195, 1318],
    12: [891, 1011, 1252, 1372],
  },
  ж: {
    7: [461, 583, 828, 950],
    8: [529, 648, 886, 1005],
    9: [556, 684, 941, 1069],
    10: [642, 762, 1004, 1124],
    11: [712, 827, 1059, 1175],
    12: [753, 867, 1096, 1210],
  },
};

export const DISHARMONIOUS_DEVELOPMENT_PAIRS = [
  [1, 3],
  [1, 4],
  [1, 5],
  [2, 4],
  [2, 5],
  [3, 5],
  [5, 1],
  [5, 2],
  [5, 3],
  [4, 2],
  [4, 1],
  [3, 1],
];

export const NOT_DEFINE = "Не определено";
export type NOT_DEFINE = typeof NOT_DEFINE;
export const NOT_DEFINE_ONE = "Не определён";
export const NOT_DEFINE_TWO = "не определена";

export const _RECOMMENDATION0 =
  "\tРежима дня должен предусматривать чередование различных видов деятельности и обеспечивать полноценный отдых. Продолжительность сна должна составлять 10-11 часов. После 19 часов ограничить эмоциональные нагрузки (шумные игры, просмотр фильмов, игры на компьютере и телефоне), за 2 часа до сна исключить использование мобильного телефона. Непрерывная длительность занятий с персональным компьютером не должна превышать 15 минут, а общая длительность занятий – 2-х часов в день. Занятия физической культурой рекомендуются в оздоровительном режиме низкой интенсивности, ЧСС 115-120 уд/мин. Показаны контрастный души дыхательные практики. Необходимо обеспечить рациональное питание (исключить продукты, содержащие кофеин: шоколад, крепкий чай, кофе, увеличить прием продуктов, содержащих соли калия и магния (гречневая, овсяная, пшенная крупы, соя, фасоль, абрикосы, персики, изюм, курага, печеный картофель, кабачки, салат, морковь), морепродуктов и рыбы)). Необходимо дополнительно добавлять в рацион витамины группы А, В, С и D, Омега-3 - полиненасыщенные жирные кислоты";
export const _RECOMMENDATION1 =
  "\tРежима дня должен предусматривать достаточный объем различных видов деятельности и полноценный отдых. Продолжительность сна составляет  9-10 часов. После 19:30 необходимо ограничить эмоциональные нагрузки (шумные игры, просмотр фильмов, игры на компьютере и телефоне), за 2 часа до сна исключить использование мобильного телефона. Непрерывная длительность занятий с персональным компьютером не должна превышать 30 минут, а общая длительность занятий – 2-х часов в день. Занятия физической культурой возможны в восстанавливающем режиме, ЧСС 120-140 уд/мин. Полезны контрастный душ и дыхательные практики. Необходимо разнообразное и полноценное питание (каши, сваренные на смеси воды и молока, свежие ягоды и фрукты или сухофруктами, орехи, блюда из индейки, курицы, нежирное мясо, морепродукты, рыба, салат, зелень, свежие, тушёные или запечённые на гриле овощи). Показано дополнительно добавлять в рацион витамины группы В, А, С и D, Омега-3 - полиненасыщенные жирные кислоты";
export const _RECOMMENDATION2 =
  "\tРежим дня предполагает оптимальную двигательную активность и полноценный отдых. Продолжительность сна должна составлять 8-9 часов. После 19:30 ограничить эмоциональные нагрузки (шумные игры, просмотр фильмов, игры на компьютере и телефоне), за 2 часа до сна исключить использование мобильного телефона. Непрерывная длительность занятий с персональным компьютером не должна превышать 30 минут, а общая длительность занятий – 2-х часов в день. Занятия физической культурой в развивающем режиме в аэробно-анаэробной зоне, ЧСС 155-180 уд/мин. Желательны контрастный душ и дыхательные практики. Необходимо обеспечить разнообразное и полноценное питание с ограничением продуктов, усиливающих метеоризм ((острые блюда, лук, чеснок, маринады, чипсы, ржаной хлеб, бобовые, избегать избытка мучных продуктов, сладостей). Рекомендуется включать продукты функционального питания, содержащих в своем составе пробиотики и пребиотики (кисломолочные продукты, квашенная капуста, сыры, бананы, яблоки, ягоды, цикорий, коричневый рис, овсяные отруби), витамины, минералы и полиненасыщенные жирные кислоты";
export const _RECOMMENDATION3 =
  "\tРежим дня должен предусматривать достаточный объем двигательной активности. Продолжительность сна должна составлять не менее 8 часов. После 20 часов ограничить эмоциональные нагрузки (шумные игры, просмотр фильмов, игры на компьютере и телефоне), за 2 часа до сна исключить использование мобильного телефона. Непрерывная длительность занятий с персональным компьютером не должна превышать 30 минут, а общая длительность занятий – 2-х часов в день. Занятия физической культурой (двигательные нагрузки без ограничений). Рациональное питание предусматривает кратность приема пищи не менее 4-5 раз в день. Ограничиваются продукты, усиливающие секрецию пищеварительных желез, а также продукты, вызывающие метеоризм (острые блюда, лук, чеснок, маринады, чипсы, ржаной хлеб, бобовые, избегать избытка мучных продуктов, сладостей). Необходим достаточный, но не чрезмерный питьевой режим";
export const _RECOMMENDATION4 =
  "\tСуществующие условия учебной деятельности и бытовые условия способствуют поддержанию оптимального функционального состояния. Сохранение режима дня и питания, рациональное сбалансированное питание. Двигательные нагрузки без ограничений";

export const RECOMMENDATIONS = [
  _RECOMMENDATION0,
  _RECOMMENDATION1,
  _RECOMMENDATION2,
  _RECOMMENDATION3,
  _RECOMMENDATION4,
];

export function STAMINA_REC(limits: number[]): string {
  return `\tДля укрепления сердечно-сосудистой системы, опорно-двигательного аппарата и снижения риска неинфекционных заболеваний рекомендуется ежедневные занятия физической активностью не менее 60 минут, при этом  большая часть ежедневной физической активности должна приходиться на циклические упражнения, направленные на развитие выносливости, к которым относятся: бег с чередованием ходьбы, бег, плавание, езда на велосипеде, катание на коньках, нагрузка на велотренажере, ходьба на лыжах, гребля, ритмическая гимнастика.\n\tПри выполнении физических упражнений аэробного характера частота сердечных сокращений должна быть в пределах от ${limits[0]} до ${limits[1]} уд./мин.`;
}

export const SPEED_REC_LINK =
  "https://docs.google.com/document/d/13dFoX_d6hlkQ3XqAZ0APGDD9ZdlR1-M5/edit?usp=sharing&ouid=112405164675299381988&rtpof=true&sd=true";
export const FLEX_REC_LINK =
  "https://docs.google.com/document/d/1WY6BJveuM3gOCfzK9DhTjli-BzWYkReD/edit?usp=sharing&ouid=112405164675299381988&rtpof=true&sd=true";
export const COORDINATION_REC_LINK =
  "https://docs.google.com/document/d/1QwKgRZjocbMOMW5YgmIyG5kjdtfbrrUd/edit?usp=sharing&ouid=112405164675299381988&rtpof=true&sd=true";
export const STRENGTH_REC_LINK =
  "https://docs.google.com/document/d/1QZ8Yz52oUA8f8OQny6CROIZ_KtUH2eI0/edit?usp=sharing&ouid=112405164675299381988&rtpof=true&sd=true";
